-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 02, 2024 at 04:21 PM
-- Server version: 10.4.19-MariaDB
-- PHP Version: 7.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `test`
--

-- --------------------------------------------------------

--
-- Table structure for table `materials`
--

CREATE TABLE `materials` (
  `mat_num` varchar(255) NOT NULL,
  `mat1` varchar(255) NOT NULL,
  `mat2` varchar(255) NOT NULL,
  `mat3` varchar(255) NOT NULL,
  `mat4` varchar(255) NOT NULL,
  `mat5` varchar(255) NOT NULL,
  `sub1` varchar(255) NOT NULL,
  `sub2` varchar(255) NOT NULL,
  `sub3` varchar(255) NOT NULL,
  `sub4` varchar(255) NOT NULL,
  `sub5` varchar(255) NOT NULL,
  `level` varchar(255) NOT NULL,
  `class` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `materials`
--

INSERT INTO `materials` (`mat_num`, `mat1`, `mat2`, `mat3`, `mat4`, `mat5`, `sub1`, `sub2`, `sub3`, `sub4`, `sub5`, `level`, `class`) VALUES
('A01', 'التشريح', 'ميكروبيولوجي عام', 'كيمياء حيوية', 'لغة انجليزية', 'تربية صحية', 'وظائف أعضاء', 'حاسب الى', 'مكافحة العدوى', 'تسجيل طبي واحصاء', 'طفيليات', 'الاولى', 'التحاليل والمختبرات'),
('A02', 'ميكروبيولوجي طبي', 'كيمياء إكلينيكية', 'أجهزة وأدوات معملية', 'لغة انجليزية', 'الجودة وسلامة المريض', 'فحوص أمراض الدم', 'طرق البحث', 'باثولوجي تطبيقي', 'حاسب الى', 'بنك الدم', 'الثانية', 'التحاليل والمختبرات'),
('A03', 'كيمياء تحليلية اكلينيكية', 'أمراض الدم', 'علم الامصال', 'الحاسب الالي', 'السلامة والصحة المهنية', 'علم أمراض الدم الاكلينيكي 2', 'البيولوجيا الجزيئية', 'علم الغدد الصماء والهرمونات', 'الجودة والاعتماد', 'علم السموم الاكلينيكية', 'الاولى تكميلي', 'التحاليل والمختبرات'),
('A04', 'ميكروبيولوجي طبي', 'تحاليل دلالات الاورام', 'المناعة الاكلينيكية', 'مبادئ صيانة الاجهزة', 'الاجهزة والمختبرات', 'ميكروبيولوجي طبي 2', 'نظم ادارية وصحية', 'المناعة الاكلينيكية ٢', 'علم الفيروسات', 'تحاليل المياه والغذاء', 'الثانية تكميلي', 'التحاليل والمختبرات'),
('D01', 'تشريح خاص', 'فيزياء', 'كيمياء', 'لغة انجليزية', 'تشريح وصفي', 'وظائف أعضاء', 'حاسب الى', 'تشريح وصفى وعلم النحت 2', 'تسجيل طبي واحصاء', 'مبادئ الجودة', 'الاولى', 'تركيبات الاسنان'),
('D02', 'أطقم الاسنان الكاملة', 'التيجان والجسور', 'مواد صناعة الاسنان', 'اللغة الانجليزية', 'مهارات التواصل', 'الهيكل المعدني للطقم الجزئي', 'مواد صناعة الأسنان', 'علم الأطباق', 'الوقاية من التلوث', 'الأجهزة الجراحية وأجهزة التقويم', 'الثانية', 'تركيبات الاسنان'),
('D03', 'تشريح', 'المواد المعملية للاسنان', 'اجهزة جراحية وتقويم', 'مكافحة العدوى', 'السلامة والصحة المهنية', 'الآلات المستخدمة في تركيبات الاسنان', 'الهيكل المعدني للطقم الجزئي', 'مقدمة لطقم الاسنان الكامل', 'بيولوجيا الفم والانسجة', 'لغة انجليزية ومصطلحات طبية', 'الاولى تكميلي', 'تركيبات الاسنان'),
('D04', 'تكنولوجية الاستعاضة', 'المعالجة المعملية للاسنان', 'اطقم الاسنان الجزئى', 'الاستعاضة السنية', 'الحاسب الالي', 'أسس الأطباق', 'مقدمة في سيراميك الاسنان', 'تركيبات تقويم الاسنان واسنان الأطفال', 'تقنيات معامل الاسنان المتطورة', 'مواد صناعة الأسنان', 'الثانية تكميلي', 'تركيبات الاسنان'),
('R01', 'تشريح عام واشعاعي', 'فيزياء تطبيقية', 'تكنولوجيا التصوير الاشعاعى', 'اللغة الانجليزية', 'تسجيل طبي واحصاء', 'وظائف أعضاء', 'حاسب الى', 'مكافحة العدوى', 'نظم ادارية وصحية', 'تكنولوجيا التصوير الاشعاعي ۲', 'الاولى', 'الاشعة'),
('R02', 'الغرفة المظلمة', 'مبادئ علم الاورام', 'التأثيرات البيولوجية', 'لغة انجليزية', 'الاسعافات الاولىة', 'طب نووی', 'مبادئ صيانة الاجهزة', 'التاثيرات البيولوجية للاشعاع والوقايه منه 2', 'السلامة والصحة المهنية', 'طرق تصوير الثدى', 'الثانية', 'الاشعة'),
('R03', 'تشريح بالاشعة المقطعية', 'الاورام بالاشعة', 'طرق التصوير', 'اللغة الانجليزية', 'الحاسب الالي', 'التشريح بالرنين المغناطيسي', 'فيزياء الرنين المغناطيسي وأشعة الثدى', 'تقنيات التصوير الرقمي', 'مبادئ الجودة وسلامة المريض', 'طرق تصوير الاسنان', 'الاولى تكميلي', 'الاشعة'),
('R04', 'العلاج الاشعاعى', 'الاوعية الدموية', 'طرق تصوير الثدي', 'المسح الذري', 'الحاسب الالي', 'تشخيص الأورام بالرنين المغناطيسي', 'الجودة والاعتماد', 'طرق التصوير بالاشعه المقطعية والرنين المغناطيسي', 'لغة انجليزية ومصطلحات', 'العقاقير المشعة', 'الثانية تكميلي', 'الاشعة');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `materials`
--
ALTER TABLE `materials`
  ADD PRIMARY KEY (`mat_num`),
  ADD KEY `level` (`level`),
  ADD KEY `class` (`class`),
  ADD KEY `level_2` (`level`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
